ЖБИ_УТ11.РасширениеЖБИ/src/Documents/ЖБИ_ФактическиеОтгрузки/ЖБИ_ФактическиеОтгрузки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЖБИ_ФактическиеОтгрузки</name>
  <comment>ЖБИ - Фактические отгрузки</comment>
  <registerRecords>AccumulationRegister.ЖБИ_ПередачаВОтгрузку</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>БанковскийСчетПлательщика</name>
    <type>
      <types>CatalogRef.БанковскиеСчетаОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.ЖБИ_ЗаявкиПокупателей</types>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>Менеджер</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Перевозчик</name>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>БанковскийСчетПеревозка</name>
    <type>
      <types>CatalogRef.БанковскиеСчетаКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодписантПеревозчик</name>
    <type>
      <types>CatalogRef.КонтактныеЛицаПартнеров</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодписантДолжностьПеревозчик</name>
    <type>
      <types>CatalogRef.ЖБИ_Должности</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодписантОснованиеСоСтороныПеревозчика</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>128</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Водитель</name>
    <type>
      <types>CatalogRef.ЖБИ_Водители</types>
    </type>
  </attributes>
  <attributes>
    <name>ДолжностьВодителя</name>
    <type>
      <types>CatalogRef.ЖБИ_Должности</types>
    </type>
  </attributes>
  <attributes>
    <name>ТелефонВодителя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПодписантЗаказчик</name>
    <type>
      <types>CatalogRef.ОтветственныеЛицаОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>ТранспортноеСредство</name>
    <type>
      <types>CatalogRef.ТранспортныеСредства</types>
    </type>
  </attributes>
  <attributes>
    <name>АвтомобильГосударственныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АвтомобильМарка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГосударственныйНомерПрицепа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МаркаПрицепа</name>
    <type>
      <types>CatalogRef.ЖБИ_МаркаПрицепа</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерПрицепа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтавкаФрахта</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗагрузки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВыгрузки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЦенаВключаетНДС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НалогообложениеНДС</name>
    <type>
      <types>EnumRef.ТипыНалогообложенияНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>СтавкаНДС</name>
    <type>
      <types>EnumRef.СтавкиНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>ФормаОплаты</name>
    <type>
      <types>EnumRef.ФормыОплаты</types>
    </type>
  </attributes>
  <attributes>
    <name>Отменено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Отгружено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОплаты</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокументыПолучены</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособЗагрузки</name>
    <type>
      <types>CatalogRef.ЖБИ_СпособЗагрузки</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <comment>Товары</comment>
    <attributes>
      <name>КодСтроки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>НоменклатураПоставщика</name>
      <comment>Номенклатура поставщика</comment>
      <type>
        <types>CatalogRef.НоменклатураПоставщиков</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <comment>Цена в счет с НДС</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Поставщик</name>
      <comment>Поставщик</comment>
      <type>
        <types>CatalogRef.Партнеры</types>
      </type>
    </attributes>
    <attributes>
      <name>Контрагент</name>
      <comment>Контрагент</comment>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>Покупатель</name>
      <comment>Покупатель</comment>
      <type>
        <types>CatalogRef.Партнеры</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <comment>План</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоКОтгрузке</name>
      <comment>Кол-во к отгрузке</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоОтгружено</name>
      <comment>Кол-во отгружено факт</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Вес</name>
      <comment>Вес, т</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>5</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОбщийВес</name>
      <comment>Общий вес, т</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КонтактныеЛицаПоставщика</name>
      <type>
        <types>CatalogRef.КонтактныеЛицаПартнеров</types>
      </type>
    </attributes>
    <attributes>
      <name>КонтактныеЛицаПокупателя</name>
      <type>
        <types>CatalogRef.КонтактныеЛицаПартнеров</types>
      </type>
    </attributes>
    <attributes>
      <name>НормаАвто</name>
      <comment>Норма погрузки</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаРазмещенияВОтгрузку</name>
      <comment>Дата размещения в отгрузку</comment>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОтгрузки</name>
      <comment>Дата отгрузки</comment>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>МенеджерОС</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ДополнительнаяИнформация</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Негабаритный</name>
      <comment>Не габарит</comment>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗаявкаПокупателя</name>
      <type>
        <types>DocumentRef.ЖБИ_ЗаявкиПокупателей</types>
      </type>
    </attributes>
    <attributes>
      <name>ПередачаВОтгрузку</name>
      <type>
        <types>DocumentRef.ЖБИ_ПередачаВОтгрузку</types>
      </type>
    </attributes>
    <attributes>
      <name>ПунктОтгрузки</name>
      <comment>Пункт отгрузки</comment>
      <type>
        <types>CatalogRef.ЖБИ_ПунктыНазначенияОтгрузки</types>
      </type>
    </attributes>
    <attributes>
      <name>ПунктНазначения</name>
      <comment>Пункт назначения</comment>
      <type>
        <types>CatalogRef.ЖБИ_ПунктыНазначенияОтгрузки</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДокументыОтгрузки</name>
    <comment>Документы</comment>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ДокументОтгрузки</name>
      <comment>Документы</comment>
      <type>
        <types>DocumentRef.ЖБИ_ДоговорЗаявка</types>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
        <types>DocumentRef.ТранспортнаяНакладная</types>
        <types>DocumentRef.ДоверенностьВыданная</types>
      </type>
    </attributes>
    <attributes>
      <name>Поставщик</name>
      <comment>Поставщик</comment>
      <type>
        <types>CatalogRef.Партнеры</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗаявкаПокупателя</name>
      <type>
        <types>DocumentRef.ЖБИ_ЗаявкиПокупателей</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерДокумента</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ЖБИ_УТ11.РасширениеЖБИ/src/InformationRegisters/ЖБИ_НумераторПродажПоДоговорам/ЖБИ_НумераторПродажПоДоговорам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЖБИ_НумераторПродажПоДоговорам</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>НомерПоПорядку</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Автор</name>
    <comment>Автор</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <dimensions>
    <name>ДоговорПродажи</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ЖБИ_УТ11.РасширениеЖБИ/src/AccumulationRegisters/ЖБИ_ПередачаВОтгрузку/ЖБИ_ПередачаВОтгрузку.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ЖБИ_ПередачаВОтгрузку</name>
  <comment>ЖБИ - Передача в отгрузку</comment>
  <resources>
    <name>ПереданоВОтгрузку</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Грузится</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Отгружено</name>
    <comment>Отгружено</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>УкрупненнаяСтавка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НормаАвто</name>
    <comment>Норма погрузки</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Негабаритный</name>
    <comment>Не габарит</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПунктОтгрузки</name>
    <comment>Пункт отгрузки</comment>
    <type>
      <types>CatalogRef.ЖБИ_ПунктыНазначенияОтгрузки</types>
    </type>
  </attributes>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЗаявкаПокупателя</name>
    <type>
      <types>DocumentRef.ЖБИ_ЗаявкиПокупателей</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПередачаВОтгрузку</name>
    <type>
      <types>DocumentRef.ЖБИ_ПередачаВОтгрузку</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Поставщик</name>
    <comment>Поставщик</comment>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НоменклатураПоставщика</name>
    <comment>Номенклатура поставщика</comment>
    <type>
      <types>CatalogRef.НоменклатураПоставщиков</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КодСтроки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

ЖБИ_УТ11.РасширениеЖБИ/src/Documents/ЖБИ_ФактическиеОтгрузки/ObjectModule.bsl
Процедура РассчитатьСуммуВсего()
	
	//СуммаДокумента = 0;
	//Для Каждого НомСтр Из Товары Цикл 
	//	СуммаДокумента = СуммаДокумента + НомСтр.Сумма;	
	//КонецЦикла;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	//Если РежимЗаписи=РежимЗаписиДокумента.Запись И НЕ ПометкаУдаления Тогда	
	//	РежимЗаписи = РежимЗаписиДокумента.Проведение;
	//КонецЕсли;
	
	РассчитатьСуммуВсего();
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	ИнициализироватьДокумент(ДанныеЗаполнения);
	
	//Нумератор продаж по договору +
	СообщениеОбОшибки 	= "";
	Если Товары.Количество() > 0 Тогда 
		НомерПоПорядку 		= Документы.ЖБИ_ФактическиеОтгрузки.ЗаполнитьНомерПоПорядку(Ссылка,Договор);
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("Период",ТекущаяДатаСеанса());
		СтруктураПараметров.Вставить("ДоговорПродажи",Договор);
		СтруктураПараметров.Вставить("НомерПоПорядку",НомерПоПорядку);
		СтруктураПараметров.Вставить("Автор",Пользователи.ТекущийПользователь());
		ТаблицаНабораЗаписей = РегистрыСведений.ЖБИ_НумераторПродажПоДоговорам.ЗаполнитьТаблицуНабораЗаписей(СтруктураПараметров);
		
		Результат = РегистрыСведений.ЖБИ_НумераторПродажПоДоговорам.СоздатьОбновитьЗаписиРегистраСведений(ТаблицаНабораЗаписей,,, СообщениеОбОшибки);
		Если Не Результат Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СообщениеОбОшибки);
			Отказ = Истина;	
		КонецЕсли;
	КонецЕсли;
	//Нумератор продаж по договору -
	
КонецПроцедуры

Процедура ИнициализироватьДокумент(ДанныеЗаполнения = Неопределено)
	
	Дата				  		= ТекущаяДатаСеанса();
	Валюта                		= ЗначениеНастроекПовтИсп.ПолучитьВалютуРегламентированногоУчета(Валюта);
	Менеджер              		= Пользователи.ТекущийПользователь();
	Автор                		= Пользователи.ТекущийПользователь();
	Организация           		= ЗначениеНастроекПовтИсп.ПолучитьОрганизациюПоУмолчанию(Организация);
	Подразделение		  		= Автор.Подразделение;
	ДатаЗагрузки		  		= ТекущаяДатаСеанса();
	ДатаВыгрузки		  		= ДатаЗагрузки + 60 * 60 * 24;
	
	БанковскийСчетПлательщика 	= Справочники.БанковскиеСчетаОрганизаций.ПолучитьБанковскийСчетОрганизацииПоУмолчанию(Организация, Валюта);	
	НалогообложениеНДС 	  		= Перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС;	
			
	//Подписанты
	ДатаАктуальности 			= ТекущаяДатаСеанса();
	СтруктураОтветственных 		= ОтветственныеЛицаСервер.ПолучитьОтветственныеЛицаОрганизации(Организация, ДатаАктуальности);
	ПодписантЗаказчик			= СтруктураОтветственных.РуководительСсылка;
	
	МаркаПрицепа				= Справочники.ЖБИ_МаркаПрицепа.НайтиПоРеквизиту("СлужебнаяКод","Полуприцеп");
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда 
		Если ДанныеЗаполнения.Свойство("Основание")
			И ТипЗнч(ДанныеЗаполнения.Основание) = Тип("ДокументСсылка.ЖБИ_ЗаявкиПокупателей") Тогда		
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
		
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	СообщениеОбОшибки 	= "";
	Отказ 				= Документы.ЖБИ_ФактическиеОтгрузки.ПроверитьЗаполнениеДокумента(Ссылка, СообщениеОбОшибки);
	Если Отказ Тогда 
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СообщениеОбОшибки);
		Возврат;
	КонецЕсли;
	
	Если ДокументыОтгрузки.Количество() = 0 Тогда 
		Отказ = Истина;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнены документы отгрузки");
		Возврат;
	КонецЕсли;
	 
	ПроведениеСерверУТ.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства, РежимПроведения);
	Документы.ЖБИ_ФактическиеОтгрузки.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);
	ОтразитьПередачаВОтгрузку(ДополнительныеСвойства, Движения, Отказ);
	Если Отгружено Тогда 
		ИзменитьСтатусЗаявкиПокупателяВОтгрузке(Отказ);
	КонецЕсли;
		
КонецПроцедуры

// Процедура формирования движений по регистру "ПередачаВОтгрузку".
//
// Параметры:
//  ДополнительныеСвойства - Структура - Структура дополнительных свойств для проведения.
//  Движения - Структура - Структура наборов движений документа.
//  Отказ - Булево - Признак отказа от проведения документа.
//
Процедура ОтразитьПередачаВОтгрузку(ДополнительныеСвойства, Движения, Отказ) Экспорт

	ТаблицаПередачаВОтгрузку = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаЖБИ_ПередачаВОтгрузку;
	
	Если Отказ ИЛИ ТаблицаПередачаВОтгрузку.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДвиженияЗаказыПоставщикам = Движения.ЖБИ_ПередачаВОтгрузку;
	ДвиженияЗаказыПоставщикам.Записывать = Истина;
	ДвиженияЗаказыПоставщикам.Загрузить(ТаблицаПередачаВОтгрузку); 
	ДвиженияЗаказыПоставщикам.Записать();
	
КонецПроцедуры

Процедура ИзменитьСтатусЗаявкиПокупателяВОтгрузке(Отказ) 
	
	МассивЗаявок 	= Товары.Выгрузить(,"ЗаявкаПокупателя").ВыгрузитьКолонку("ЗаявкаПокупателя");
	Запрос 			= Новый Запрос;
	Запрос.УстановитьПараметр("Дата",Новый Граница(МоментВремени(), ВидГраницы.Включая));
	Запрос.УстановитьПараметр("МассивЗаявок",МассивЗаявок);
	Запрос.Текст 	= "ВЫБРАТЬ
					  |	ЖБИ_ПередачаВОтгрузкуОстатки.ЗаявкаПокупателя КАК ЗаявкаПокупателя,
	             	  |	ЕСТЬNULL(ЖБИ_ПередачаВОтгрузкуОстатки.ОтгруженоОстаток,0) КАК ОтгруженоОстаток	             	  
	             	  |ИЗ
	             	  |	РегистрНакопления.ЖБИ_ПередачаВОтгрузку.Остатки(&Дата, ЗаявкаПокупателя В (&МассивЗаявок)) КАК ЖБИ_ПередачаВОтгрузкуОстатки";
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	Пока РезультатЗапроса.Следующий() Цикл
		ТЧСчет 				 = РезультатЗапроса.ЗаявкаПокупателя.СчетНаОплату;
		КолВсегоПоСчету 	 = ТЧСчет.Итог("Количество");
		КоличествоОтгружено  = 0;
		Если КолВсегоПоСчету <> РезультатЗапроса.ОтгруженоОстаток Тогда 
			Продолжить;	
		КонецЕсли;
		ДокОбъект 			= РезультатЗапроса.ЗаявкаПокупателя.ПолучитьОбъект();
		ДокОбъект.Статус 	= Перечисления.ЖБИ_СтатусЗаявкиПокупателя.Отгружен;
		Попытка
			ДокОбъект.Записать();
		Исключение
			Отказ = Истина;
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		КонецПопытки;
	КонецЦикла;	
	
	////МоментСразуПослеДокумента = МоментВремени().Дата + 1; 
	//МассивЗаявок 	= Товары.Выгрузить(,"ЗаявкаПокупателя").ВыгрузитьКолонку("ЗаявкаПокупателя");
	//Запрос 			= Новый Запрос;
	////Запрос.УстановитьПараметр("Дата", МоментСразуПослеДокумента);
	//Запрос.УстановитьПараметр("МассивЗаявок",МассивЗаявок);
	//Запрос.Текст 	= "ВЫБРАТЬ
	//					|	ЖБИ_ПередачаВОтгрузкуОстатки.ЗаявкаПокупателя КАК ЗаявкаПокупателя,
	//					|	ЕСТЬNULL(ЖБИ_ПередачаВОтгрузкуОстатки.Отгружено, 0) КАК ОтгруженоОстаток
	//					|ИЗ
	//					|	РегистрНакопления.ЖБИ_ПередачаВОтгрузку КАК ЖБИ_ПередачаВОтгрузкуОстатки
	//					|ГДЕ
	//					|	ЖБИ_ПередачаВОтгрузкуОстатки.ЗаявкаПокупателя В(&МассивЗаявок)
	//					|ИТОГИ ПО
	//					|	ЗаявкаПокупателя";
	//
	//ВыборкаЗаявкаПокупателя = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	//Пока ВыборкаЗаявкаПокупателя.Следующий() Цикл   
	//	РезультатЗапроса = ВыборкаЗаявкаПокупателя.Выбрать(); 
	//	ИзменитьСтатус   = Ложь;
	//	Пока РезультатЗапроса.Следующий() Цикл  
	//		
	//		Если РезультатЗапроса.ОтгруженоОстаток = 0 Тогда 
	//			Продолжить;
	//		КонецЕсли; 
	//		
	//		ТЧСчет 				 = РезультатЗапроса.ЗаявкаПокупателя.СчетНаОплату;
	//		КолВсегоПоСчету 	 = ТЧСчет.Итог("Количество");
	//		КоличествоОтгружено  = 0;
	//		НайденныеСтроки = Товары.НайтиСтроки(Новый Структура("ЗаявкаПокупателя",РезультатЗапроса.ЗаявкаПокупателя));
	//		Для Каждого Ном Из НайденныеСтроки Цикл 
	//			КоличествоОтгружено = КоличествоОтгружено + Ном.КоличествоОтгружено;	
	//		КонецЦикла;
	//		Если КолВсегоПоСчету <> РезультатЗапроса.ОтгруженоОстаток + КоличествоОтгружено Тогда 
	//			Продолжить;	
	//		КонецЕсли;
	//		ИзменитьСтатус = Истина;	
	//	КонецЦикла;
	//	
	//	Если ИзменитьСтатус Тогда
	//		ДокОбъект 			= ВыборкаЗаявкаПокупателя.ЗаявкаПокупателя.ПолучитьОбъект();
	//		ДокОбъект.Статус 	= Перечисления.ЖБИ_СтатусЗаявкиПокупателя.Отгружен;
	//		Попытка
	//			ДокОбъект.Записать();
	//		Исключение
	//			Отказ = Истина;
	//			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	//		КонецПопытки;
	//	КонецЕсли;
	//КонецЦикла;
	
КонецПроцедуры
